Revit 2026 API

# DividedSurfaceGetTileFamilyInstance Method

---

Get a reference to a tile element associated with a given seed node.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyInstance GetTileFamilyInstance(
	GridNode gridNode,
	int tileIndex
)
```
```vb
Public Function GetTileFamilyInstance (
	gridNode As GridNode,
	tileIndex As Integer
) As FamilyInstance
```
```cpp
public:
FamilyInstance^ GetTileFamilyInstance(
	GridNode gridNode,
	int tileIndex
)
```
```fsharp
member GetTileFamilyInstance :
        gridNode : GridNode *
        tileIndex : int -> FamilyInstance
```

#### Parameters

gridNode GridNode

tileIndex Int32

#### Return Value

FamilyInstanceA FamilyInstance object. Returns  if the ObjectType property is not a FamilySymbol. Returns  if the grid node is not a "seed node", or if the tile is omitted due to boundary conditions.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown if the grid node is outside of the range specified by NumberOfUGridlines and NumberOfVGridlines, or if tileIndex is outside the range [0, TilesPerSeedNode-1]. |

#### Reference

DividedSurface Class

Autodesk.Revit.DB Namespace